export const lessons = [
    {
        id: 1,
        thumbnailUrl: '/lessonBg/1.png',
        title: 'แบบจำลองอะตอม',
        description: 'เรียนรู้เกี่ยวกับต้นกำเนิดการศึกษาอะตอม และแบบจำลองอะตอมทั้ง 5 แบบ',
        href: '/pages/lessons/pages/atomic-model'

    },
    {
        id: 2,
        thumbnailUrl: '/lessonBg/2.png',
        title: 'การจัดเรียงอิเล็กตรอนในอะตอม',
        description: 'เรียนรู้เกี่ยวกับการจัดเรียงอิเล็กตรอนในอะตอมแบบต่างๆ และหลักการกับกฎต่างๆของการจัดเรียงอิเล็กตรอนในอะตอม',
        href: '/pages/lessons/pages/electron-config'

    },
    {
        id: 3,
        thumbnailUrl: '/lessonBg/3.png',
        title: 'ตารางธาตุ',
        description: 'เรียนรู้เกี่ยวกับตารางธาตุ ส่วนประกอบของตารางธาตุ วิวัฒนาการตารางธาตุ และอื่นๆ',
        href: '/pages/lessons/pages/periodic-table'

    },
    {
        id: 4,
        thumbnailUrl: '/lessonBg/4.png',
        title: 'สมบัติของธาตุตามหมู่และคาบ',
        description: 'เรียนรู้เกี่ยวก้บสมบัติของธาตุตามหมู่และธาตุเช่น IE EA EN จุดเดือดจุดหลอมเหลว เป็นต้น',
        href: '/pages/lessons/pages/element-properties'
    },
    {
        id: 5,
        thumbnailUrl: '/lessonBg/5.png',
        title: 'ธาตุทรานซิชั่น',
        description: 'เรียนรู้เกี่ยวกับสมบัติของธาตุทรานซิชั่น และสารประกอบของธาตุทรานซิชั่น',
        href: '/pages/lessons/pages/transition-element'
    },
    {
        id: 6,
        thumbnailUrl: '/lessonBg/6.png',
        title: 'ธาตุกัมมันตรังสี',
        description: 'เรียนรู้เกี่ยวกับการเกิดกัมมันตภาพรังสี การสลายตัวของธาตุกัมมันตรังส ครึ่งชีวิตของธาตุกัมมันตรังสี และอื่นๆ',
        href: '/pages/lessons/pages/radioactive-element'
    },
    {
        id: 7,
        thumbnailUrl: '/lessonBg/7.png',
        title: 'ธาตุและสารประกอบในสิ่งมีชีวิตและสิ่งแวดล้อม',
        description: 'เรียนรู้เกี่ยวกับธาตุและสารประกอบในสิ่งมีชีวิตและสิ่งแวดล้อม เช่น ธาตุ Calcium',
        href: '/pages/lessons/pages/element-in-life'
    },
]

export const lessonDetails = [
    {
        id: 1,
        details: [
            'แบบจำลองอะตอมของดอลตัน',
            'แบบจำลองอะตอมของทอมสัน',
            'แบบจำลองอะตอมของรัทเทอร์ฟอร์ด',
            'แบบจำลองอะตอมของโบร์',
            'แบบจำลองอะตอมแบบกลุ่มหมอก'
        ]
    },
    {
        id: 2,
        details: [
            'หลักการกีดกันของเพาลี',
            'หลักอาฟบาว',
            'กฎของฮุนด์',
            'การบรรจุอิเล็กตรอนแบบเต็มและแบบครึ่ง'
        ]
    },
    {
        id: 3,
        details: [
            'วิวัฒนาการของตารางธาตุ',
            'หมู่และคาบในตารางธาตุ'
        ]
    },
    {
        id: 4,
        details: [
            'ขนาดอะตอม',
            'รัศมีไอออน',
            'พลังงานไอออไนเซชัน',
            'อิเล็กโทรเนกาติวิตี',
            'สัมพรรคภาพอิเล็กตรอน',
            'จุดเดือดและจุดหลอมเหลว ',
            'เลขออกซิเดชัน'
        ]
    },
    {
        id: 5,
        details: [
            'สมบัติของธาตุแทรนซิชันที่แตกต่างจากโลหะหมู่ IA และ IIA',
            'สารประกอบของธาตุแทรนซิชัน '
        ]
    },
    {
        id: 6,
        details: [
            'การเกิดกัมมันตภาพรังสี',
            'การสลายตัวของธาตุกัมมันตรังสี',
            'ครึ่งชีวิตของธาตุกัมมันตรังสี',
            'ปฏิกิริยานิวเคลียร์',
            'การตรวจสอบสารกัมมันตรังสี และ เทคโนโลยีที่เกี่ยวข้องกับการใช้สารกัมมันตรังสี ',
            'อันตรายจากธาตุกัมมันตรังสี'
        ]
    },
    {
        id: 7,
        details: [
            'ธาตุแคลเซียม ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุอะลูมิเนียม ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุซิลิคอน ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุไนโตรเจน ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุฟอสฟอรัส ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุออกซิเจน ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุไอโอดีน ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุเหล็ก ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุทองแดง ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุสังกะสี ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุโครเมียม ในสิ่งมีชีวิตและ สิ่งแวดล้อม',
            'ธาตุเรเดียม ในสิ่งมีชีวิตและ สิ่งแวดล้อม'
        ]
    }
]